nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.c
/*
* Copyright 2024 NXP
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.14.12
pin_labels:
- {pin_num: K15, pin_signal: GPIO_AD_21, label: M2_UDC, identifier: CUR_A;CUR_A2;M2_UDC}
- {pin_num: K12, pin_signal: GPIO_AD_22, label: M1_IDC, identifier: CUR_C;M1_IDC}
- {pin_num: N15, pin_signal: GPIO_AD_13, label: M2_IB, identifier: TP1;M2_IB}
- {pin_num: P17, pin_signal: GPIO_AD_12, label: TP119, identifier: TP2;M2_IA;TP119}
- {pin_num: B4, pin_signal: GPIO_AON_04, label: SW8, identifier: SW8}
- {pin_num: K3, pin_signal: GPIO_EMC_B1_06, label: USER_LED0, identifier: USER_LED0}
- {pin_num: M3, pin_signal: GPIO_EMC_B1_07, label: USER_LED1, identifier: USER_LED1}
- {pin_num: H5, pin_signal: GPIO_EMC_B1_08, label: USER_LED2, identifier: USER_LED2}
- {pin_num: E1, pin_signal: GPIO_EMC_B1_09, label: USER_LED3, identifier: USER_LED3}
- {pin_num: G6, pin_signal: GPIO_EMC_B1_12, label: M1_PWM_A0, identifier: M1_PWM_A0}
- {pin_num: F3, pin_signal: GPIO_EMC_B1_13, label: M1_PWM_B0, identifier: M1_PWM_B0}
- {pin_num: G5, pin_signal: GPIO_EMC_B1_14, label: M1_PWM_A1, identifier: M1_PWM_A1}
- {pin_num: G2, pin_signal: GPIO_EMC_B1_15, label: M1_PWM_B1, identifier: M1_PWM_B1}
- {pin_num: E2, pin_signal: GPIO_EMC_B1_17, label: M1_PWM_A2, identifier: M1_PWM_A2}
- {pin_num: H1, pin_signal: GPIO_EMC_B1_16, label: M1_PWM_B2, identifier: M1_PWM_B2}
- {pin_num: D1, pin_signal: GPIO_EMC_B1_18, label: M2_PWM_A0, identifier: M2_PWM_A0}
- {pin_num: F4, pin_signal: GPIO_EMC_B1_19, label: M2_PWM_B0, identifier: M2_PWM_B0}
- {pin_num: G1, pin_signal: GPIO_EMC_B1_20, label: M2_PWM_A1, identifier: M2_PWM_A1}
- {pin_num: K4, pin_signal: GPIO_EMC_B1_21, label: M2_PWM_B1, identifier: M2_PWM_B1}
- {pin_num: F1, pin_signal: GPIO_EMC_B1_23, label: M2_PWM_A2, identifier: M2_PWM_A2}
- {pin_num: L3, pin_signal: GPIO_EMC_B1_22, label: M2_PWM_B2, identifier: M2_PWM_B2}
- {pin_num: N14, pin_signal: GPIO_AD_14, label: M1_IA, identifier: M1_IA}
- {pin_num: N16, pin_signal: GPIO_AD_15, label: M1_IB, identifier: M1_IB}
- {pin_num: K16, pin_signal: GPIO_AD_18, label: M1_IC, identifier: M1_IC}
- {pin_num: L13, pin_signal: GPIO_AD_19, label: M1_UDC, identifier: M1_UDC}
- {pin_num: K13, pin_signal: GPIO_AD_20, label: M2_IC, identifier: M2_IC}
- {pin_num: K14, pin_signal: GPIO_AD_23, label: M2_IDC, identifier: M2_IDC}
- {pin_num: B15, pin_signal: GPIO_SD_B1_04, label: M1_GD3000_RESET, identifier: M1_GD3000_RESET}
- {pin_num: A16, pin_signal: GPIO_SD_B1_05, label: M1_GD3000_EN, identifier: M1_GD3000_EN}
- {pin_num: D5, pin_signal: GPIO_AON_19, label: M2_GD3000_RESET, identifier: M2_GD3000_RESET}
- {pin_num: E5, pin_signal: GPIO_AON_20, label: M2_GD3000_EN, identifier: M2_GD3000_EN}
- {pin_num: H3, pin_signal: GPIO_EMC_B1_00, label: M1_FAULT_OV, identifier: M1_FAULT_OC;M1_FAULT_OV}
- {pin_num: H4, pin_signal: GPIO_EMC_B1_01, label: M1_FAULT_OC, identifier: M1_FAULT_OC}
- {pin_num: N4, pin_signal: GPIO_EMC_B1_26, label: M1_FAULT_OT, identifier: M1_FAULT_OT}
- {pin_num: B13, pin_signal: GPIO_B1_04, label: M2_FAULT_OV, identifier: M2_FAULT_OV}
- {pin_num: J4, pin_signal: GPIO_EMC_B1_04, label: M2_FAULT_OV, identifier: M2_FAULT_OV}
- {pin_num: H6, pin_signal: GPIO_EMC_B1_05, label: M2_FAULT_OC, identifier: M2_FAULT_OC}
- {pin_num: E9, pin_signal: GPIO_B2_00, label: TP150, identifier: TP150}
- {pin_num: E10, pin_signal: GPIO_B2_01, label: TP151, identifier: TP151}
- {pin_num: F2, pin_signal: GPIO_EMC_B1_11, label: M2_485, identifier: M1_485;M2_485}
- {pin_num: E3, pin_signal: GPIO_EMC_B1_10, label: M1_485, identifier: M2_485;M1_485}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbar.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitADC();
    BOARD_InitPWM();
    BOARD_InitLPUART();
    BOARD_InitENC();
    BOARD_InitCMP();
    BOARD_InitLPSPI3();
    BOARD_InitLPSPI2();
    SINC_Motor1();
    SINC_Motor2();
    BOARD_UART5();
    BOARD_UART8();
    M7_DebugConsole();
    SLOWLOOP_TRIGGER();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: K3, peripheral: RGPIO2, signal: 'gpio_io, 06', pin_signal: GPIO_EMC_B1_06, direction: OUTPUT}
  - {pin_num: M3, peripheral: RGPIO2, signal: 'gpio_io, 07', pin_signal: GPIO_EMC_B1_07, direction: OUTPUT}
  - {pin_num: E1, peripheral: RGPIO2, signal: 'gpio_io, 09', pin_signal: GPIO_EMC_B1_09, direction: OUTPUT}
  - {pin_num: E9, peripheral: RGPIO6, signal: 'gpio_io, 14', pin_signal: GPIO_B2_00, direction: OUTPUT}
  - {pin_num: E10, peripheral: RGPIO6, signal: 'gpio_io, 15', pin_signal: GPIO_B2_01, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of USER_LED0 on GPIO_EMC_B1_06 (pin K3) */
  rgpio_pin_config_t USER_LED0_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_06 (pin K3) */
  RGPIO_PinInit(RGPIO2, 6U, &USER_LED0_config);

  /* GPIO configuration of USER_LED1 on GPIO_EMC_B1_07 (pin M3) */
  rgpio_pin_config_t USER_LED1_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_07 (pin M3) */
  RGPIO_PinInit(RGPIO2, 7U, &USER_LED1_config);

