nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G6, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: F3, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_13}
  - {pin_num: G5, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_14}
  - {pin_num: G2, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_B1_15}
  - {pin_num: E2, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_17}
  - {pin_num: H1, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_B1_16}
  - {pin_num: D1, peripheral: PWM2, signal: 'A, 0', pin_signal: GPIO_EMC_B1_18}
  - {pin_num: F4, peripheral: PWM2, signal: 'B, 0', pin_signal: GPIO_EMC_B1_19}
  - {pin_num: G1, peripheral: PWM2, signal: 'A, 1', pin_signal: GPIO_EMC_B1_20}
  - {pin_num: K4, peripheral: PWM2, signal: 'B, 1', pin_signal: GPIO_EMC_B1_21}
  - {pin_num: F1, peripheral: PWM2, signal: 'A, 2', pin_signal: GPIO_EMC_B1_23}
  - {pin_num: L3, peripheral: PWM2, signal: 'B, 2', pin_signal: GPIO_EMC_B1_22}
  - {pin_num: H3, peripheral: PWM4, signal: 'FAULT, 0', pin_signal: GPIO_EMC_B1_00, identifier: M1_FAULT_OV}
  - {pin_num: H4, peripheral: PWM4, signal: 'FAULT, 1', pin_signal: GPIO_EMC_B1_01}
  - {pin_num: N4, peripheral: PWM4, signal: 'FAULT, 2', pin_signal: GPIO_EMC_B1_26}
  - {pin_num: J4, peripheral: PWM2, signal: 'FAULT, 0', pin_signal: GPIO_EMC_B1_04}
  - {pin_num: H6, peripheral: PWM2, signal: 'FAULT, 1', pin_signal: GPIO_EMC_B1_05}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 0', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 1', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 2', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
  - {peripheral: PWM4, signal: FORCE, pin_signal: ECAT_SYNC_OUT0}
  - {peripheral: PWM2, signal: 'EXT_SYNC, 3', pin_signal: FLEXPWM4_PWM0_OUT_TRIG0_1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_10_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4(0x00U) /* IOMUXC XBAR_INOUT4 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5(0x00U) /* IOMUXC XBAR_INOUT5 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8(0x00U) /* IOMUXC XBAR_INOUT8 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9(0x00U) /* IOMUXC XBAR_INOUT9 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_10(0x00U) /* IOMUXC XBAR_INOUT10 function direction select: XBAR_INOUT as input */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_XBAR1_XBAR_INOUT04,  /* GPIO_EMC_B1_00 is configured as XBAR1_XBAR_INOUT04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_XBAR1_XBAR_INOUT05,  /* GPIO_EMC_B1_01 is configured as XBAR1_XBAR_INOUT05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_XBAR1_XBAR_INOUT08,  /* GPIO_EMC_B1_04 is configured as XBAR1_XBAR_INOUT08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_XBAR1_XBAR_INOUT09,  /* GPIO_EMC_B1_05 is configured as XBAR1_XBAR_INOUT09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXPWM4_PWMA00,  /* GPIO_EMC_B1_12 is configured as FLEXPWM4_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_FLEXPWM4_PWMB00,  /* GPIO_EMC_B1_13 is configured as FLEXPWM4_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_14_FLEXPWM4_PWMA01,  /* GPIO_EMC_B1_14 is configured as FLEXPWM4_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_15_FLEXPWM4_PWMB01,  /* GPIO_EMC_B1_15 is configured as FLEXPWM4_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_16_FLEXPWM4_PWMB02,  /* GPIO_EMC_B1_16 is configured as FLEXPWM4_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_17_FLEXPWM4_PWMA02,  /* GPIO_EMC_B1_17 is configured as FLEXPWM4_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_18_FLEXPWM2_PWMA00,  /* GPIO_EMC_B1_18 is configured as FLEXPWM2_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_19_FLEXPWM2_PWMB00,  /* GPIO_EMC_B1_19 is configured as FLEXPWM2_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_20_FLEXPWM2_PWMA01,  /* GPIO_EMC_B1_20 is configured as FLEXPWM2_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_21_FLEXPWM2_PWMB01,  /* GPIO_EMC_B1_21 is configured as FLEXPWM2_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_22_FLEXPWM2_PWMB02,  /* GPIO_EMC_B1_22 is configured as FLEXPWM2_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_23_FLEXPWM2_PWMA02,  /* GPIO_EMC_B1_23 is configured as FLEXPWM2_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_26_XBAR1_XBAR_INOUT10,  /* GPIO_EMC_B1_26 is configured as XBAR1_XBAR_INOUT10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout10, kXBAR1_OutputFlexpwm1234Fault2); /* IOMUX_XBAR_INOUT10 output assigned to XBAR1_IN10 input is connected to XBAR1_OUT53 output assigned to FLEXPWM1_2_3_4_FAULT2 */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputFlexpwm2ExtSync0); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT60 output assigned to FLEXPWM2_EXT_SYNC0 */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputFlexpwm2ExtSync1); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT61 output assigned to FLEXPWM2_EXT_SYNC1 */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputFlexpwm2ExtSync2); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT62 output assigned to FLEXPWM2_EXT_SYNC2 */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm0OutTrig01, kXBAR1_OutputFlexpwm2ExtSync3); /* FLEXPWM4_PWM0_OUT_TRIG0_1 output assigned to XBAR1_IN90 input is connected to XBAR1_OUT63 output assigned to FLEXPWM2_EXT_SYNC3 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout08, kXBAR1_OutputFlexpwm2Fault0); /* IOMUX_XBAR_INOUT08 output assigned to XBAR1_IN8 input is connected to XBAR1_OUT65 output assigned to FLEXPWM2_FAULT0 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout09, kXBAR1_OutputFlexpwm2Fault1); /* IOMUX_XBAR_INOUT09 output assigned to XBAR1_IN9 input is connected to XBAR1_OUT66 output assigned to FLEXPWM2_FAULT1 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout04, kXBAR1_OutputFlexpwm4Fault0); /* IOMUX_XBAR_INOUT04 output assigned to XBAR1_IN4 input is connected to XBAR1_OUT84 output assigned to FLEXPWM4_FAULT0 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout05, kXBAR1_OutputFlexpwm4Fault1); /* IOMUX_XBAR_INOUT05 output assigned to XBAR1_IN5 input is connected to XBAR1_OUT85 output assigned to FLEXPWM4_FAULT1 */
  XBAR_SetSignalsConnection(kXBAR1_InputEcatSyncOut0, kXBAR1_OutputFlexpwm4ExtForce); /* ECAT_SYNC_OUT0 output assigned to XBAR1_IN214 input is connected to XBAR1_OUT86 output assigned to FLEXPWM4_EXT_FORCE */
}


