nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPUART:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, pull_keeper_select: Keeper}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, pull_keeper_select: Keeper}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPUART, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPUART(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENC:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: F5, peripheral: EQDC1, signal: 'PHASE, A', pin_signal: GPIO_EMC_B1_28}
  - {pin_num: E4, peripheral: EQDC1, signal: 'PHASE, B', pin_signal: GPIO_EMC_B1_29}
  - {pin_num: N5, peripheral: EQDC1, signal: INDEX, pin_signal: GPIO_EMC_B2_00}
  - {pin_num: N5, peripheral: EQDC1, signal: 'CAP, 1', pin_signal: GPIO_EMC_B2_00}
  - {pin_num: T5, peripheral: EQDC2, signal: 'PHASE, A', pin_signal: GPIO_EMC_B2_03}
  - {pin_num: P5, peripheral: EQDC2, signal: 'PHASE, B', pin_signal: GPIO_EMC_B2_02}
  - {pin_num: R2, peripheral: EQDC2, signal: INDEX, pin_signal: GPIO_EMC_B2_01}
  - {pin_num: R2, peripheral: EQDC2, signal: 'CAP, 1', pin_signal: GPIO_EMC_B2_01}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENC, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENC(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_12_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_13_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_20_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_21_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_22_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_12(0x00U) /* IOMUXC XBAR_INOUT12 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_13(0x00U) /* IOMUXC XBAR_INOUT13 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_20(0x00U) /* IOMUXC XBAR_INOUT20 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_21(0x00U) /* IOMUXC XBAR_INOUT21 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_22(0x00U) /* IOMUXC XBAR_INOUT22 function direction select: XBAR_INOUT as input */
      | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23(0x00U) /* IOMUXC XBAR_INOUT23 function direction select: XBAR_INOUT as input */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_28_XBAR1_XBAR_INOUT12,  /* GPIO_EMC_B1_28 is configured as XBAR1_XBAR_INOUT12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_29_XBAR1_XBAR_INOUT13,  /* GPIO_EMC_B1_29 is configured as XBAR1_XBAR_INOUT13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_00_XBAR1_XBAR_INOUT20,  /* GPIO_EMC_B2_00 is configured as XBAR1_XBAR_INOUT20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_01_XBAR1_XBAR_INOUT21,  /* GPIO_EMC_B2_01 is configured as XBAR1_XBAR_INOUT21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_02_XBAR1_XBAR_INOUT22,  /* GPIO_EMC_B2_02 is configured as XBAR1_XBAR_INOUT22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_03_XBAR1_XBAR_INOUT23,  /* GPIO_EMC_B2_03 is configured as XBAR1_XBAR_INOUT23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout20, kXBAR1_OutputEqdc1Icap1); /* IOMUX_XBAR_INOUT20 output assigned to XBAR1_IN20 input is connected to XBAR1_OUT206 output assigned to EQDC1_ICAP1 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout21, kXBAR1_OutputEqdc2Icap1); /* IOMUX_XBAR_INOUT21 output assigned to XBAR1_IN21 input is connected to XBAR1_OUT209 output assigned to EQDC2_ICAP1 */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout12, kXBAR1_OutputEqdc1Phasea); /* IOMUX_XBAR_INOUT12 output assigned to XBAR1_IN12 input is connected to XBAR1_OUT87 output assigned to EQDC1_PHASEA */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout13, kXBAR1_OutputEqdc1Phaseb); /* IOMUX_XBAR_INOUT13 output assigned to XBAR1_IN13 input is connected to XBAR1_OUT88 output assigned to EQDC1_PHASEB */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout20, kXBAR1_OutputEqdc1Index); /* IOMUX_XBAR_INOUT20 output assigned to XBAR1_IN20 input is connected to XBAR1_OUT89 output assigned to EQDC1_INDEX */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout23, kXBAR1_OutputEqdc2Phasea); /* IOMUX_XBAR_INOUT23 output assigned to XBAR1_IN23 input is connected to XBAR1_OUT92 output assigned to EQDC2_PHASEA */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout22, kXBAR1_OutputEqdc2Phaseb); /* IOMUX_XBAR_INOUT22 output assigned to XBAR1_IN22 input is connected to XBAR1_OUT93 output assigned to EQDC2_PHASEB */
  XBAR_SetSignalsConnection(kXBAR1_InputIomuxXbarInout21, kXBAR1_OutputEqdc2Index); /* IOMUX_XBAR_INOUT21 output assigned to XBAR1_IN21 input is connected to XBAR1_OUT94 output assigned to EQDC2_INDEX */
}


