nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCMP:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCMP, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCMP(void) {
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPSPI3:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: B16, peripheral: LPSPI3, signal: PCS0, pin_signal: GPIO_SD_B1_00}
  - {pin_num: D15, peripheral: LPSPI3, signal: SCK, pin_signal: GPIO_SD_B1_01}
  - {pin_num: D14, peripheral: LPSPI3, signal: SOUT, pin_signal: GPIO_SD_B1_02}
  - {pin_num: C15, peripheral: LPSPI3, signal: SIN, pin_signal: GPIO_SD_B1_03}
  - {pin_num: B15, peripheral: RGPIO5, signal: 'gpio_io, 08', pin_signal: GPIO_SD_B1_04, direction: OUTPUT, gpio_init_state: 'true', pull_down_pull_up_config: Pull_Forbidden}
  - {pin_num: A16, peripheral: RGPIO5, signal: 'gpio_io, 09', pin_signal: GPIO_SD_B1_05, direction: OUTPUT, gpio_init_state: 'false', pull_down_pull_up_config: Pull_Forbidden}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPSPI3, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPSPI3(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of M1_GD3000_RESET on GPIO_SD_B1_04 (pin B15) */
  rgpio_pin_config_t M1_GD3000_RESET_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 1U,
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_04 (pin B15) */
  RGPIO_PinInit(RGPIO5, 8U, &M1_GD3000_RESET_config);

  /* GPIO configuration of M1_GD3000_EN on GPIO_SD_B1_05 (pin A16) */
  rgpio_pin_config_t M1_GD3000_EN_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_05 (pin A16) */
  RGPIO_PinInit(RGPIO5, 9U, &M1_GD3000_EN_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_00_LPSPI3_PCS0,       /* GPIO_SD_B1_00 is configured as LPSPI3_PCS0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_01_LPSPI3_SCK,        /* GPIO_SD_B1_01 is configured as LPSPI3_SCK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_02_LPSPI3_SDO,        /* GPIO_SD_B1_02 is configured as LPSPI3_SDO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_03_LPSPI3_SDI,        /* GPIO_SD_B1_03 is configured as LPSPI3_SDI */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_04_GPIO5_IO08,        /* GPIO_SD_B1_04 is configured as GPIO5_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_05_GPIO5_IO09,        /* GPIO_SD_B1_05 is configured as GPIO5_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_04_GPIO5_IO08,        /* GPIO_SD_B1_04 PAD functional properties : */
      0x00U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: Forbidden
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_05_GPIO5_IO09,        /* GPIO_SD_B1_05 PAD functional properties : */
      0x00U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: Forbidden
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPSPI2:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: D2, peripheral: LPSPI2, signal: PCS0, pin_signal: GPIO_AON_25}
  - {pin_num: C3, peripheral: LPSPI2, signal: SCK, pin_signal: GPIO_AON_22}
  - {pin_num: C1, peripheral: LPSPI2, signal: SIN, pin_signal: GPIO_AON_24}
  - {pin_num: C2, peripheral: LPSPI2, signal: SOUT, pin_signal: GPIO_AON_23}
  - {pin_num: D5, peripheral: RGPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AON_19, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: E5, peripheral: RGPIO1, signal: 'gpio_io, 20', pin_signal: GPIO_AON_20, direction: OUTPUT, gpio_init_state: 'false'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLPSPI2, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLPSPI2(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of M2_GD3000_RESET on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_19 (pin D5) */
  rgpio_pin_config_t M2_GD3000_RESET_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 1U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_19 (pin D5) */
  RGPIO_PinInit(RGPIO1, 19U, &M2_GD3000_RESET_config);

