nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.c
  /* GPIO configuration of M2_GD3000_EN on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_20 (pin E5) */
  rgpio_pin_config_t M2_GD3000_EN_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_20 (pin E5) */
  RGPIO_PinInit(RGPIO1, 20U, &M2_GD3000_EN_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_19_GPIO1_IO19,          /* GPIO_AON_19 is configured as GPIO1_IO19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_20_GPIO1_IO20,          /* GPIO_AON_20 is configured as GPIO1_IO20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_22_LPSPI2_SCK,          /* GPIO_AON_22 is configured as LPSPI2_SCK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_23_LPSPI2_SDO,          /* GPIO_AON_23 is configured as LPSPI2_SDO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_24_LPSPI2_SDI,          /* GPIO_AON_24 is configured as LPSPI2_SDI */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_25_LPSPI2_PCS0,         /* GPIO_AON_25 is configured as LPSPI2_PCS0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SINC_Motor1:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N12, peripheral: SINC1, signal: 'MOD_CLK, 0', pin_signal: GPIO_AD_00}
  - {pin_num: R14, peripheral: SINC1, signal: 'MOD_CLK, 1', pin_signal: GPIO_AD_01}
  - {pin_num: R13, peripheral: SINC1, signal: 'MOD_CLK, 2', pin_signal: GPIO_AD_02}
  - {pin_num: R15, peripheral: SINC1, signal: 'EMCLK, 0', pin_signal: GPIO_AD_03}
  - {pin_num: P15, peripheral: SINC1, signal: 'EMBIT, 0', pin_signal: GPIO_AD_04}
  - {pin_num: P13, peripheral: SINC1, signal: 'EMCLK, 1', pin_signal: GPIO_AD_05}
  - {pin_num: N13, peripheral: SINC1, signal: 'EMBIT, 1', pin_signal: GPIO_AD_06}
  - {pin_num: T17, peripheral: SINC1, signal: 'EMCLK, 2', pin_signal: GPIO_AD_07}
  - {pin_num: T14, peripheral: SINC1, signal: 'EMBIT, 2', pin_signal: GPIO_AD_08}
  - {pin_num: R16, peripheral: SINC1, signal: 'EMCLK, 3', pin_signal: GPIO_AD_09}
  - {pin_num: R17, peripheral: SINC1, signal: 'EMBIT, 3', pin_signal: GPIO_AD_10}
  - {peripheral: SINC1, signal: 'EXT_TRIG, 0', pin_signal: FLEXPWM4_PWM2_OUT_TRIG0_1}
  - {pin_num: P16, peripheral: SINC1, signal: sinc_break, pin_signal: GPIO_AD_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SINC_Motor1, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SINC_Motor1(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_00_SINC1_MOD_CLK0,       /* GPIO_AD_00 is configured as SINC1_MOD_CLK0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_01_SINC1_MOD_CLK1,       /* GPIO_AD_01 is configured as SINC1_MOD_CLK1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_02_SINC1_MOD_CLK2,       /* GPIO_AD_02 is configured as SINC1_MOD_CLK2 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_03_SINC1_EMCLK00,        /* GPIO_AD_03 is configured as SINC1_EMCLK00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_04_SINC1_EMBIT00,        /* GPIO_AD_04 is configured as SINC1_EMBIT00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_05_SINC1_EMCLK01,        /* GPIO_AD_05 is configured as SINC1_EMCLK01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_06_SINC1_EMBIT01,        /* GPIO_AD_06 is configured as SINC1_EMBIT01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_07_SINC1_EMCLK02,        /* GPIO_AD_07 is configured as SINC1_EMCLK02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_08_SINC1_EMBIT02,        /* GPIO_AD_08 is configured as SINC1_EMBIT02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_09_SINC1_EMCLK03,        /* GPIO_AD_09 is configured as SINC1_EMCLK03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_10_SINC1_EMBIT03,        /* GPIO_AD_10 is configured as SINC1_EMBIT03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_11_SINC_FILTER_GLUE1_BREAK,  /* GPIO_AD_11 is configured as SINC_FILTER_GLUE1_BREAK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm2OutTrig01, kXBAR1_OutputSinc123ExtTrig0); /* FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBAR1_IN92 input is connected to XBAR1_OUT148 output assigned to SINC1_2_3_EXT_TRIG0 */
}


