nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SINC_Motor2:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: M14, peripheral: SINC2, signal: 'EMCLK, 0', pin_signal: GPIO_AD_26}
  - {pin_num: M16, peripheral: SINC2, signal: 'EMBIT, 0', pin_signal: GPIO_AD_27}
  - {pin_num: L16, peripheral: SINC2, signal: 'EMCLK, 1', pin_signal: GPIO_AD_28}
  - {pin_num: L15, peripheral: SINC2, signal: 'EMBIT, 1', pin_signal: GPIO_AD_29}
  - {pin_num: L17, peripheral: SINC2, signal: 'EMCLK, 2', pin_signal: GPIO_AD_30}
  - {pin_num: K17, peripheral: SINC2, signal: 'EMBIT, 2', pin_signal: GPIO_AD_31}
  - {pin_num: J17, peripheral: SINC2, signal: 'EMCLK, 3', pin_signal: GPIO_AD_32}
  - {pin_num: J16, peripheral: SINC2, signal: 'EMBIT, 3', pin_signal: GPIO_AD_33}
  - {peripheral: SINC2, signal: 'EXT_TRIG, 1', pin_signal: FLEXPWM4_PWM2_OUT_TRIG0_1}
  - {pin_num: H17, peripheral: SINC2, signal: 'MOD_CLK, 0', pin_signal: GPIO_AD_35}
  - {pin_num: M13, peripheral: SINC2, signal: 'MOD_CLK, 1', pin_signal: GPIO_AD_24}
  - {pin_num: M15, peripheral: SINC2, signal: 'MOD_CLK, 2', pin_signal: GPIO_AD_25}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SINC_Motor2, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SINC_Motor2(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_SINC2_MOD_CLK1,       /* GPIO_AD_24 is configured as SINC2_MOD_CLK1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_SINC2_MOD_CLK2,       /* GPIO_AD_25 is configured as SINC2_MOD_CLK2 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_26_SINC2_EMCLK00,        /* GPIO_AD_26 is configured as SINC2_EMCLK00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_SINC2_EMBIT00,        /* GPIO_AD_27 is configured as SINC2_EMBIT00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_28_SINC2_EMCLK01,        /* GPIO_AD_28 is configured as SINC2_EMCLK01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_29_SINC2_EMBIT01,        /* GPIO_AD_29 is configured as SINC2_EMBIT01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_SINC2_EMCLK02,        /* GPIO_AD_30 is configured as SINC2_EMCLK02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_31_SINC2_EMBIT02,        /* GPIO_AD_31 is configured as SINC2_EMBIT02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_32_SINC2_EMCLK03,        /* GPIO_AD_32 is configured as SINC2_EMCLK03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_33_SINC2_EMBIT03,        /* GPIO_AD_33 is configured as SINC2_EMBIT03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_35_SINC2_MOD_CLK0,       /* GPIO_AD_35 is configured as SINC2_MOD_CLK0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  XBAR_SetSignalsConnection(kXBAR1_InputFlexpwm4Pwm2OutTrig01, kXBAR1_OutputSinc123ExtTrig1); /* FLEXPWM4_PWM2_OUT_TRIG0_1 output assigned to XBAR1_IN92 input is connected to XBAR1_OUT149 output assigned to SINC1_2_3_EXT_TRIG1 */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_UART5:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: F16, peripheral: LPUART5, signal: RXD, pin_signal: GPIO_SD_B2_09}
  - {pin_num: F14, peripheral: LPUART5, signal: TXD, pin_signal: GPIO_SD_B2_08}
  - {pin_num: E3, peripheral: RGPIO2, signal: 'gpio_io, 10', pin_signal: GPIO_EMC_B1_10, identifier: M1_485, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_UART5, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_UART5(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of M1_485 on GPIO_EMC_B1_10 (pin E3) */
  rgpio_pin_config_t M1_485_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_10 (pin E3) */
  RGPIO_PinInit(RGPIO2, 10U, &M1_485_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_10_GPIO2_IO10,       /* GPIO_EMC_B1_10 is configured as GPIO2_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_08_LPUART5_TX,        /* GPIO_SD_B2_08 is configured as LPUART5_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_09_LPUART5_RX,        /* GPIO_SD_B2_09 is configured as LPUART5_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


