nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_UART8:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: H14, peripheral: LPUART8, signal: RXD, pin_signal: GPIO_SD_B2_01}
  - {pin_num: H15, peripheral: LPUART8, signal: TXD, pin_signal: GPIO_SD_B2_00}
  - {pin_num: F2, peripheral: RGPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_EMC_B1_11, identifier: M2_485, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_UART8, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_UART8(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of M2_485 on GPIO_EMC_B1_11 (pin F2) */
  rgpio_pin_config_t M2_485_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_11 (pin F2) */
  RGPIO_PinInit(RGPIO2, 11U, &M2_485_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_GPIO2_IO11,       /* GPIO_EMC_B1_11 is configured as GPIO2_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_00_LPUART8_TX,        /* GPIO_SD_B2_00 is configured as LPUART8_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_01_LPUART8_RX,        /* GPIO_SD_B2_01 is configured as LPUART8_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
M7_DebugConsole:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: K2, peripheral: LPUART3, signal: RXD, pin_signal: GPIO_EMC_B1_02}
  - {pin_num: G3, peripheral: LPUART3, signal: TXD, pin_signal: GPIO_EMC_B1_03}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : M7_DebugConsole, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void M7_DebugConsole(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_LPUART3_RX,       /* GPIO_EMC_B1_02 is configured as LPUART3_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_LPUART3_TX,       /* GPIO_EMC_B1_03 is configured as LPUART3_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SLOWLOOP_TRIGGER:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {peripheral: TMR1, signal: 'TIMER_INPUT, 0', pin_signal: ECAT_SYNC_OUT0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SLOWLOOP_TRIGGER, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SLOWLOOP_TRIGGER(void) {
  CLOCK_EnableClock(kCLOCK_Xbar1);            /* Turn on LPCG: LPCG is ON. */

  BLK_CTRL_WAKEUPMIX->QTIMER_CTRL1 = ((BLK_CTRL_WAKEUPMIX->QTIMER_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL(0x01U) /* QTIMER1 TMR0 input select: Input from XBAR */
    );
  XBAR_SetSignalsConnection(kXBAR1_InputEcatSyncOut0, kXBAR1_OutputQtimer1Timer0); /* ECAT_SYNC_OUT0 output assigned to XBAR1_IN214 input is connected to XBAR1_OUT107 output assigned to QTIMER1_TIMER0 */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
